{
  "_name_or_path": "RWKV/rwkv-raven-3b",
  "architectures": [
    "RwkvForCausalLM"
  ],
  "attention_hidden_size": 2560,
  "bos_token_id": 0,
  "context_length": 1024,
  "eos_token_id": 0,
  "hidden_size": 2560,
  "intermediate_size": 10240,
  "layer_norm_epsilon": 1e-05,
  "model_type": "rwkv",
  "num_hidden_layers": 32,
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": null,
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "rescale_every": 0,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.41.0.dev0",
  "use_cache": false,
  "vocab_size": 50277
}
